# Python과 SQL 연동
* pip install PyMySQL
* cursor 객체 : 레코드를 순차적으로 가져온다. 그래서 반복문으로 변수에 저장해야한다.
    - fetchall()    : fetch는 데이터를 가져오는 기능. 모든 레코드를 다 가져온다.
    - fetchmany()   : 레코드 중 일부를 가져온다.
    - fetchone()    : 레코드를 하나씩 가져온다.
    - 객체 생략시엔 fetchall이 default값.
    - dictcursor    : 필드명을 인덱스 대신 키로 사용
* 파이썬으로 데이터 불러오거나, 반복적으로 DB에 데이터 입력해야할 때 sql보다 편하게 쓸 수 있다.
* 다만 안정성 측면에서 불안하니, 정말 필요한 거 아니면 IDE나 터미널로 db에 접근하는 것이 좋다.

In [ ]:
import pymysql
import pandas as pd

In [ ]:
config = {"host" : "127.0.0.1", "user" : "root", "passwd" : "Wpdntm123!@#", "database" : "testdb"}

In [ ]:
conn = pymysql.connect(**config)
print(conn)
conn.close()

<pymysql.connections.Connection object at 0x7fc0507298b0>

In [ ]:
# SELECT
conn = pymysql.connect(**config)
sql = "SELECT * FROM emp limit 5" # 명령어를 담은 변수를 DB에 보내면 이 변수에 담긴 명령어를 실행하는 방식
# 명령어 변수를 실어나르고 DB에 실행시키고 결과를 파이썬으로 불러오는 객체 존재.

cursor = conn.cursor()
cursor.execute(sql)

# print(cursor)
# -> <pymysql.cursors.Cursor object at 0x7fc04148f580> 여기에 결과물이 담겨있다.

# for data in cursor:
#     print(data)

# for a, b, c, d, e, f, g, h in cursor:
#      print(a)
#      print(b,c,d,e,f,g,h)

# (a,b,c,d,e) = cursor
# print(a)

# print('='*50)

result = []
for data in cursor:
    result.append(data)

conn.close()

print(result)

df = pd.DataFrame(result, columns=['empno', 'name', 'job', 'manager', 'hiredate','salary', 'bonus', 'deptno'])
df

[(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)]

   empno    name       job  manager   hiredate  salary   bonus  deptno
0   7369   SMITH     CLERK     7902 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN     7698 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN     7698 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER     7839 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN     7698 1981-09-28  1250.0  1400.0      30

In [ ]:
# 2. Insert

conn = pymysql.connect(**config)

sql = """create table if not exists tbltest(
    empno int,
    ename varchar(10),
    sal int,
    job varchar(10)
)"""

cur = conn.cursor()
cur.execute(sql)

print(cur)

sql_insert = "insert into tbltest(empno, ename, sal) values(1, 'scott', 5000)"

cur.execute(sql_insert)
conn.commit()

conn.close()


# MariaDB [testdb]> SELECT * FROM tbltest;
# +-------+-------+------+------+
# | empno | ename | sal  | job  |
# +-------+-------+------+------+
# |     1 | scott | 5000 | NULL |
# +-------+-------+------+------+

<pymysql.cursors.Cursor object at 0x7fc0603c07c0>

In [ ]:
empno = 2
ename = "miller"
sal = 1300

conn = pymysql.connect(**config)
cur = conn.cursor()

sql_insert1 = "insert into tbltest(empno, ename, sal) values(" + str(empno) + ", '" + ename + "', " + str(sal) + ")"
cur.execute(sql_insert1)
conn.commit()
conn.close()

# MariaDB [testdb]> SELECT * FROM tbltest;
# +-------+--------+------+------+
# | empno | ename  | sal  | job  |
# +-------+--------+------+------+
# |     1 | scott  | 5000 | NULL |
# |     2 | miller | 1300 | NULL |
# +-------+--------+------+------+

In [ ]:
empno = 3
ename = "tom"
sal = 2000

conn = pymysql.connect(**config)
cur = conn.cursor()

sql_insert2 = "insert into tbltest(empno, ename, sal) values(%s, %s, %s)"
sql_data = (str(empno), ename, str(sal))
cur.execute(sql_insert2, sql_data)
conn.commit()
conn.close()

# MariaDB [testdb]> SELECT * FROM tbltest;
# +-------+--------+------+------+
# | empno | ename  | sal  | job  |
# +-------+--------+------+------+
# |     1 | scott  | 5000 | NULL |
# |     2 | miller | 1300 | NULL |
# |     3 | tom    | 2000 | NULL |
# +-------+--------+------+------+
# 3 rows in set (0.000 sec)

In [ ]:
# 두 프로그램을 연결하는 방법이라 불안정. 그래서 정식으로 코드를 짤 땐 예외처리 방식으로 진행되도록 만들어야 한다.
# try - except

empno = 4
ename = "jerry"
sal = 2000

try:
    conn = pymysql.connect(**config)
    cur = conn.cursor()

    sql_insert2 = "insert into tbltest(empno, ename, sal) values(%s, %s, %s)"
    sql_data = (str(empno), ename, str(sal))

    cur.execute(sql_insert2, sql_data)
    conn.commit()

except Exception as e:
    print("error :", e)

finally:
    conn.close()

# 에러가 발생해도 반드시 연결은 끊어져야하므로! 아니면 프로그램 무거워지고 결국 뻑난다.    
 

# MariaDB [testdb]> SELECT * FROM tbltest;
# +-------+--------+------+------+
# | empno | ename  | sal  | job  |
# +-------+--------+------+------+
# |     1 | scott  | 5000 | NULL |
# |     2 | miller | 1300 | NULL |
# |     3 | tom    | 2000 | NULL |
# |     4 | jerry  | 2000 | NULL |
# |     4 | jerry  | 2000 | NULL |
# +-------+--------+------+------+

In [ ]:
#3. 반복문으로 DATA 여러개 입력하기
#SQL엔 없는 기능. 이런 것 때문에 파이썬과 SQL은 상호보완적

conn = pymysql.connect(**config)
cur = conn.cursor()

for i in range(10):
    sql = "insert into tbltest(empno, ename, sal) values(5, 'jane', 10000)"
    cur.execute(sql)
    conn.commit()

conn.close()

In [ ]:
#3. Cursor

try:
    conn = pymysql.connect(**config)
    cur = conn.cursor()
    cur.execute("select * from tbltest")

    # for i in cur.fetchall():
    #     print(i)
        # (1, 'scott', 5000, None)
        # (2, 'miller', 1300, None)
        # (3, 'tom', 2000, None)
        # (4, 'jerry', 2000, None)
        # (4, 'jerry', 2000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)
        # (5, 'jane', 10000, None)

    # for i in cur.fetchmany(5):
    #     print(i)
        # (1, 'scott', 5000, None)
        # (2, 'miller', 1300, None)
        # (3, 'tom', 2000, None)
        # (4, 'jerry', 2000, None)
        # (4, 'jerry', 2000, None)

    for i in cur.fetchone():
        print(cur.fetchone())
finally:
    conn.close()

(2, 'miller', 1300, None)
(3, 'tom', 2000, None)
(4, 'jerry', 2000, None)
(4, 'jerry', 2000, None)

In [ ]:
try:
    conn = pymysql.connect(**config)
    cur = conn.cursor()
    cur.execute("select * from tbltest")

    for i in cur.fetchall():
        print(i[0], i[1], i[2])

finally:
    conn.close()

1 scott 5000
2 miller 1300
3 tom 2000
4 jerry 2000
4 jerry 2000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000

In [ ]:
try:
    conn = pymysql.connect(**config)
    cur = conn.cursor(pymysql.cursors.DictCursor)
    cur.execute("select * from tbltest")

    for i in cur.fetchall():
        print(i['empno'], i['ename'], i['sal'])

finally:
    conn.close()

1 scott 5000
2 miller 1300
3 tom 2000
4 jerry 2000
4 jerry 2000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000

In [ ]:
#csv 파일에 있는 데이터, 파이썬을 이용해 DB에 넣기
import csv
file = csv.reader(open('./input.csv'))
# print(file)
# print(next(file)) #현재 위치한 줄을 읽어오고 다음 줄에 위치하게 만드는 명령어
# print(next(file))
# print(next(file))
# print(next(file))
# print(next(file))
# print(next(file))

next(file) #필드명은 건너뛰어야하니까.
try :
    conn = pymysql.connect(**config)
    cur = conn.cursor()

    cur.execute("delete from suppliers")
    conn.commit()
    # 반복시행 시 누적되는 것을 막아주려면?

    for i in file:
        sql = "insert into suppliers values(%s, %s, %s, %s, %s)"
        cur.execute(sql, i)
    
    conn.commit()

finally :
    conn.close()

In [ ]:
try :
    conn = pymysql.connect(**config)
    cur = conn.cursor()
    cur.execute("select * from suppliers where cost > 500000")

    # for i in cur:
    #     print(i)
    # ('A', '001-1003', '5467', 750000.0, datetime.date(2014, 1, 20))
    # ('A', '001-1004', '5467', 750000.0, datetime.date(2014, 1, 20))
    # ('C', '001-1009', '3321', 615000.0, datetime.date(2017, 2, 3))
    # ('C', '001-1010', '3321', 615000.0, datetime.date(2017, 2, 10))
    # ('C', '001-1011', '3321', 615000.0, datetime.date(2017, 2, 17))
    # ('C', '001-1012', '3321', 615000.0, datetime.date(2017, 2, 24))

    file = csv.writer(open("./output.cs", "w"), delimiter = ",")
    #csv.writer는 데이터간 구분짓는 문자를 지정할 수 있다. delimiter 이용

    header = ["Supplier_Name","Invoice_Number","Part_Number","Cost","Purchase_Date"] #여백없이 해야 필드명으로 지정된다.
    file.writerow(header)

    for i in cur:
        file.writerow(i)

finally :
    conn.close()

## 2. 파이썬과 SQLite

#### (1). 로컬로 사용할 수 있는 DBMS
+ Access
+ SQLite
+ Microsoft SQL Server Compact Edition
+ Firebird Embeded Server
+ +H2
+ HSQL
+ Apache Derby

#### (2). 특징
+ 파일기반의 DBMS, 저메모리, 빠른 처리 속도 : 데이터 파일로 전달 가능!
+ 오픈 소스
+ 별도의 DB서버없이 쉽고 편리하게 사용 할 수 있는 Embeded SQL DB 엔진
+ 안드로이드, 아이폰 등의 스마트폰에 기본 내장된 DB
+ 파이썬에 내장
+ 표준 SQL 지원

+ 칼럼을 삭제하거나 변경하는 것 등 제한
+ Left Outer Join만 지원
+ 읽기 전용 뷰만 제공

#### (3) 공식사이트

+ http://sqlite.org
+ client program ::
    - http://www.sqliteexpert.com

#### (4) 파이썬에 내장되어있어 바로 사용 가능

In [ ]:
import sqlite3
from os import mkdir

In [ ]:
print(sqlite3.version)
print(sqlite3.sqlite_version)
# python - sqlite3 - db
# sqlite는 파이썬과 db를 연결하는 매개체

2.6.0
3.36.0

In [ ]:
#db와 연결
try:
    conn = sqlite3.connect('folder_A/my_database.db')
except sqlite3.OperationalError:
    mkdir('folder_A')
finally:
    conn = sqlite3.connect('folder_A/my_database.db')

In [ ]:
#db 종료
conn.close()

In [ ]:
conn =sqlite3.connect('folder_A/my_database.db')

In [ ]:
# Query Language를 받아주는 객체 지정해주자. *cursor
cur = conn.cursor()

In [ ]:
cur.execute("select * from tblbook")
for row in cur:
    print(row)

('최주현', '하늘과 땅')
('최주현', '바다')
('유은정', '바다')
('박성우', '문')
('최주현', '문')
('박성우', '천국')
('최지은', '천국')
('최주현', '천국')
('박성우', '고슴도치')
('서금동', '나')

In [ ]:
conn.close()

In [ ]:
conn =sqlite3.connect('folder_A/my_database.db')
cur = conn.cursor()
cur.execute("select * from tblMember")
for row in cur:
    print(row)
conn.close()

(1, '홍길동', '2020-12-25')
(2, '임꺽정', '2022-01-05')

In [ ]:
#### 자동으로 DB 생성하고 테이블 생성

try:
    conn = sqlite3.connect('data/auto.db')
except sqlite3.OperationalError:
    mkdir('data')
finally:
    conn = sqlite3.connect('data/auto.db')

cur = conn.cursor()

sql = """create table if not exists tblmember(
    id  int,
    name    varchar(10)
)
"""

cur.execute(sql)
conn.commit()

cur.execute("insert into tblmember values(1, '홍길동')")
conn.commit

cur.execute("insert into tblmember values(1, '홍길동')")
conn.commit

cur.execute("select * from tblmember")
for row in cur:
    print(row)

conn.close()

(1, '홍길동')
(1, '홍길동')

In [ ]:
### csv 파일 읽어서 DB에 저장
import csv

conn = sqlite3.connect("data/auto.db")
cur = conn.cursor()

# 테이블 조회
# tables = cur.execute("select * from sqlite_master where type='table'")
# for i in tables:
#     print(i[1])

file = csv.reader(open("data/input.csv", "r"), delimiter=",")
# for i in file:
#     print(i)

#입력
next(file) #칼럼은 입력하면 안되니까 포인트를 다음 줄로 넘겨준다

for row in file:
    cur.execute("insert into tblInput values(?, ?, ?, ?, ?)", row)

conn.commit()
conn.close()

In [ ]:
conn = sqlite3.connect("data/auto.db")
cur = conn.cursor()

cur.execute("select * from tblInput")
for i in cur:
    print(i)

conn.close()

('A', '001-1001', 2341, 500000, '2014-01-20')
('A', '001-1002', 2341, 500000, '2014-01-20')
('A', '001-1003', 5467, 750000, '2014-01-20')
('A', '001-1004', 5467, 750000, '2014-01-20')
('B', '001-1005', 7009, 250000, '2018-01-30')
('B', '001-1006', 7009, 250000, '2018-01-30')
('B', '001-1007', 6650, 125000, '2017-02-03')
('B', '001-1008', 6650, 125000, '2017-02-03')
('C', '001-1009', 3321, 615000, '2017-02-03')
('C', '001-1010', 3321, 615000, '2017-02-10')
('C', '001-1011', 3321, 615000, '2017-02-17')
('C', '001-1012', 3321, 615000, '2017-02-24')

In [ ]:
#### Memory DB ####
# 메모리에 올려두고 쓰면 더 빠르다. 다만, 효율이 떨어짐

conn = sqlite3.connect(":memory:")
#print(conn)
cur = conn.cursor()

cur.execute("create table phonebook(name vachar(10), phonenumber text);")
cur.execute("insert into phonebook values(?, ?);", ("tom", "010-111-1111"))

cur.execute("select * from phonebook")
for i in cur:
    print(i)

# 메모리에 두면 저장이 안된다
# 메모리에서 다 작업했으면 파일로 저장해야한다.

f = open("data/dump.sql", "w")
#conn에 지금까지 한 작업 로그들이 남아있음
for i in conn.iterdump():
    f.write("{}\n".format(i))

f.close()
conn.close()

('tom', '010-111-1111')

In [ ]:
#auto.db에 메모리에서 작업한 내용 넣어보자
conn = sqlite3.connect("data/auto.db")
cur = conn.cursor()

f = open("data/dump.sql", "r")
script = f.read()
print(script)

cur.executescript(script)
conn.close()

# near "WnCREATE": syntax error
# Wn이 입력된 거 찾아봐

BEGIN TRANSACTION;
CREATE TABLE phonebook(name vachar(10), phonenumber text);
INSERT INTO "phonebook" VALUES('tom','010-111-1111');
COMMIT;